Revit 2024 API
SolidCurveIntersection Methods
The SolidCurveIntersection type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetCurveSegment
 Gets the curve segment generated by intersection.
GetCurveSegmentExtents
 Gets the extents for the given curve segment generated by intersection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace